In [1]:
import subprocess
import os
import sys

In [2]:
import seaborn as sns 
import numpy as np

In [19]:
from os import listdir
from os.path import isfile, join


mypath=subprocess.run('pwd',stdout=subprocess.PIPE,shell=True,encoding='utf-8').stdout
mypath=mypath[:-1]

onlyfiles = [f for f in listdir(mypath) if isfile(join(mypath, f))]

In [ ]:
lsb_release -d

In [20]:
onlyfiles

['mon_fichier.txt', 'Untitled.ipynb', '__init__.py']

In [18]:
mypath=mypath[:-1]

In [14]:
mypath=subprocess.run('pwd',stdout=subprocess.PIPE,shell=True,encoding='utf-8').stdout

In [22]:
subprocess.run(["touch","mon_fichier.txt"])

CompletedProcess(args=['touch', 'mon_fichier.txt'], returncode=0)

In [30]:
subprocess.run(["echo 'ceci est un input' >> mon_fichier.txt"],shell=True,encoding='utf-8')

CompletedProcess(args=["echo 'ceci est un input' >> mon_fichier.txt"], returncode=0)

In [47]:
subprocess.run(['read varname'],shell=True)

CompletedProcess(args=['read varname'], returncode=1)

In [46]:
cmd = ['awk', 'length($0) > 5']
ip = 'foo\nfoofoo\n'.encode('utf-8')
result = subprocess.run(cmd, stdout=subprocess.PIPE, input=ip)
result.stdout.decode('utf-8')

'foofoo\n'

In [39]:
text.args

['mon_fichier.txt']

In [3]:
df = sns.load_dataset('titanic')

In [4]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [24]:
df[df['age'].isnull()]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
17,1,2,male,NaN,0,0,13.0000,S,Second,man,True,NaN,Southampton,yes,True
19,1,3,female,NaN,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True
26,0,3,male,NaN,0,0,7.2250,C,Third,man,True,NaN,Cherbourg,no,True
28,1,3,female,NaN,0,0,7.8792,Q,Third,woman,False,NaN,Queenstown,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
859,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True
863,0,3,female,NaN,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False
868,0,3,male,NaN,0,0,9.5000,S,Third,man,True,NaN,Southampton,no,True
878,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [48]:
df[df['age']== 0.67]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
755,1,2,male,0.67,1,1,14.5,S,Second,child,False,NaN,Southampton,yes,False

In [42]:
for age, who in zip(df.age,df.who):
    if age == '':
        print(who)

In [5]:
age_moyen=df.groupby('who')['age'].mean()

In [6]:
age_moyen

who
child     6.369518
man      33.173123
woman    32.000000
Name: age, dtype: float64

In [7]:
df['age'].loc[(df['age'].isnull()) & (df['who']== 'child')] = df.groupby('who')['age'].mean().child
df['age'].loc[(df['age'].isnull()) & (df['who']== 'man')]  = df.groupby('who')['age'].mean().man
df['age'].loc[(df['age'].isnull()) & (df['who']== 'man')]  = df.groupby('who')['age'].mean().man

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [13]:
df['age'][(df['age'].isnull()) & (df['who'] == 'child')]

Series([], Name: age, dtype: float64)

In [63]:
for age,who in zip(df.age,df.who):
    if df['who']== 'child':
        df['age'].replace(np.nan, age_moyen.child)
    if df['who']== 'woman':
        df['age'].replace(np.nan, age_moyen.woman)
    if df['who']== 'man':
        df['age'].replace(np.nan, age_moyen.man)

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [14]:
os.name

'posix'